xlloss/ble_uart_bridge/nRF5_SDK_12.3.0_d7731ad/examples/ble_central/ble_app_multilink_central/main.c
            packet_data_cnt[ble_hd] = packet_data_cnt[ble_hd] + 1;

            err_code = app_fifo_put(&packet_data_tx_order_hd, ble_hd);
            if (err_code != NRF_SUCCESS) {
              NRF_LOG_INFO ("packet_data_tx_order_hd app_fifo_put fail: ble_hd %d\r\n", ble_hd);
            }
            NRF_LOG_INFO ("ble_hd %d\r\n", ble_hd);
//#ifdef DEBUG
//            NRF_LOG_INFO("BLE_NUS_C_EVT_NUS_RX_EVT %d\r\n", p_ble_nus_c->conn_handle);
//            NRF_LOG_INFO("DBG : data_len %d\r\n", p_ble_nus_evt->data_len);
//            for (uint32_t i = 0; i < p_ble_nus_evt->data_len; i++)
//              NRF_LOG_INFO("%c\r\n", p_ble_nus_evt->p_data[i]);
//
//            NRF_LOG_INFO("\r\n");
//#endif
//            //packet_order
//            for (uint32_t i = 0; i < p_ble_nus_evt->data_len; i++) {
//              if (i + 2 < p_ble_nus_evt->data_len && packet_data_cnt[ble_hd] == 0) {
//                packet_head[ble_hd][0] = p_ble_nus_evt->p_data[i + 0];
//                packet_head[ble_hd][1] = p_ble_nus_evt->p_data[i + 1];
//                packet_head[ble_hd][2] = p_ble_nus_evt->p_data[i + 2];
//              }
//
//              if (packet_head[ble_hd][0] == '$' && packet_head[ble_hd][1] == '$' && packet_head[ble_hd][2] == '$' && packet_data_cnt[ble_hd] == 0) {
//                    err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, packet_head[ble_hd][0]);
//                    err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, packet_head[ble_hd][1]);
//                    err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, packet_head[ble_hd][2]);
//                    if (err_code != NRF_SUCCESS) {
//                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
//                      NRF_LOG_INFO("app_fifo_put fail ble_hd %d\r\n", ble_hd);
//                      packet_data_cnt[ble_hd] = 0;
//                      packet_head[ble_hd][0] = 0;
//                      packet_head[ble_hd][1] = 0;
//                      packet_head[ble_hd][2] = 0;
//                      goto err_exit;
//                    }
//                    packet_data_cnt[ble_hd] = 3;
//                    i = i + 2;
//                    continue;
//              } else if (packet_data_cnt[ble_hd] >= 3) {
//                    err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, p_ble_nus_evt->p_data[i]);
//                    if (err_code != NRF_SUCCESS) {
//                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
//                      NRF_LOG_INFO("app_fifo_put fail ble_hd %d\r\n", ble_hd);
//                      packet_data_cnt[ble_hd] = 0;
//                      packet_head[ble_hd][0] = 0;
//                      packet_head[ble_hd][1] = 0;
//                      packet_head[ble_hd][2] = 0;
//                      goto err_exit;
//                    }
//                    
//                    packet_data_cnt[ble_hd] = packet_data_cnt[ble_hd] + 1;
//              }
//
//              if (i + 2 < p_ble_nus_evt->data_len && packet_data_cnt[ble_hd] > 3) {
//                packet_end[ble_hd][0] = p_ble_nus_evt->p_data[i + 0];
//                packet_end[ble_hd][1] = p_ble_nus_evt->p_data[i + 1];
//                packet_end[ble_hd][2] = p_ble_nus_evt->p_data[i + 2];
//                
//                if (packet_end[ble_hd][0] == '#' && packet_end[ble_hd][1] == '#' && packet_end[ble_hd][2] == '#') {
//                  
//                    err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, '#');
//                    if (err_code != NRF_SUCCESS) {
//                      NRF_LOG_INFO("app_fifo_put fail ble_hd %d\r\n", ble_hd);
//                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
//                      packet_data_cnt[ble_hd] = 0;
//                      packet_head[ble_hd][0] = 0;
//                      packet_head[ble_hd][1] = 0;
//                      packet_head[ble_hd][2] = 0;
//                      goto err_exit;
//                    }
//
//                    err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, '#');
//                    if (err_code != NRF_SUCCESS) {
//                      NRF_LOG_INFO("app_fifo_put fail ble_hd %d\r\n", ble_hd);
//                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
//                      packet_data_cnt[ble_hd] = 0;
//                      packet_head[ble_hd][0] = 0;
//                      packet_head[ble_hd][1] = 0;
//                      packet_head[ble_hd][2] = 0;
//                      goto err_exit;
//                    }
//
//                    packet_data_cnt[ble_hd] = packet_data_cnt[ble_hd] + 2;
//
//                    NRF_LOG_INFO("!!! ble_hd %d!!!\r\n",  ble_hd);                    
//
//                    err_code = app_fifo_put(&packet_data_tx_order_hd, ble_hd);
//                    if (err_code != NRF_SUCCESS) {
//                      NRF_LOG_INFO ("packet_data_tx_order_hd FIFO put FAIL\r\n");
//                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
//                      packet_data_cnt[ble_hd] = 0;
//                      packet_head[ble_hd][0] = 0;
//                      packet_head[ble_hd][1] = 0;
//                      packet_head[ble_hd][2] = 0;
//                      goto err_exit;
//                    }
//
//                    err_code = app_fifo_put(&packet_data_tx_order_hd, ble_hd);
//                    if (err_code != NRF_SUCCESS) {
//                      NRF_LOG_INFO ("packet_data_tx_order_hd FIFO put FAIL\r\n");
//                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
//                      packet_data_cnt[ble_hd] = 0;
//                      packet_head[ble_hd][0] = 0;
//                      packet_head[ble_hd][1] = 0;
//                      packet_head[ble_hd][2] = 0;
//                      goto err_exit;
//                    }
//
//                    err_code = app_fifo_put(&packet_data_tx_order_hd, ble_hd);
//                    if (err_code != NRF_SUCCESS) {
//                      NRF_LOG_INFO ("packet_data_tx_order_hd FIFO put FAIL\r\n");
//                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
//                      packet_data_cnt[ble_hd] = 0;
//                      packet_head[ble_hd][0] = 0;
//                      packet_head[ble_hd][1] = 0;
//                      packet_head[ble_hd][2] = 0;
//                      goto err_exit;
//                    }
//
//                    packet_data_cnt[ble_hd] = 0;
//                    packet_head[ble_hd][0] = 0;
//                    packet_head[ble_hd][1] = 0;
//                    packet_head[ble_hd][2] = 0;
//
//                    if (tx_order_index_buy >= TX_ORDER_NUM) {
//                      tx_order_index_buy = 0;
//                    }
//                    
//                    i = i + 2;
//                    continue;
//                }
//              }
//            }
//err_exit:
            break;

        case BLE_NUS_C_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected\r\n");
            scan_start();
            break;
    }
}


