xlloss/ble_uart_bridge/nRF5_SDK_12.3.0_d7731ad/examples/ble_central/ble_app_multilink_central/main.c
int my_ble_hd = 0;
static void ble_process_buf_handler(void * p_context)
{
  int eat_i = 0, get_out = 0, i = 0;
  unsigned char uart_tx_buffer, ble_hd;
  uint32_t err_code = NRF_SUCCESS;
  UNUSED_PARAMETER(p_context);
  
  //NRF_LOG_INFO ("ble_process_buf_handler\r\n");
  app_timer_stop(m_ble_tx_timer_id);

  if (my_ble_hd >= 7)
    my_ble_hd = 0;
  
  NRF_LOG_INFO ("ble_process_buf_handler my_ble_hd %d %d\r\n", my_ble_hd, packet_data_cnt[my_ble_hd]);
  if (packet_data_cnt[my_ble_hd] < 3) {
    app_timer_start(m_ble_tx_timer_id, TIMER_BLE_TX_INTERVAL, NULL);
    my_ble_hd++;
    return;
  }


//  err_code = app_fifo_get(&packet_data_tx_order_hd, &ble_hd);
//  if (err_code != NRF_SUCCESS) {
//    NRF_LOG_INFO ("packet_data_tx_order_hd FIFO get fail\r\n");
//    goto exit;
//  }

  

  if (packet_data_cnt[my_ble_hd] < 3) {
    app_timer_start(m_ble_tx_timer_id, TIMER_BLE_TX_INTERVAL, NULL);
    return;
  }

  packet_data_cnt[my_ble_hd] = 0;

  while (1) {
    NRF_LOG_INFO ("while loop\r\n");
    err_code = app_fifo_get(&tx_fifo[my_ble_hd].tx_fifo_handle, &uart_tx_buffer);
    if (err_code != NRF_SUCCESS) {
      break;
    }

    if (uart_tx_buffer == '#')
      get_out++;
  
    while (app_uart_put(uart_tx_buffer) != NRF_SUCCESS);
    
    if (get_out >= 3)
      break;
  };
  
  my_ble_hd++;
exit:
  nrf_delay_ms(10);
  app_timer_start(m_ble_tx_timer_id, TIMER_BLE_TX_INTERVAL, NULL);
}


static void application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_ble_tx_timer_id, TIMER_BLE_TX_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

/* For BLE uart RX buffer */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers.
    err_code = app_timer_create(&m_ble_tx_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                ble_process_buf_handler);
    APP_ERROR_CHECK(err_code);
}

int main(void)
{
    ret_code_t err_code;
    int i = 0;
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO(TEST_VERSION);
    
    timers_init();

		uart_init();
    ble_stack_init();

    db_discovery_init();
    nus_c_init();
    
    NRF_LOG_INFO("Multi Link Uart Bridge\r\n");

    for (i = 0; i < CENTRAL_LINK_COUNT; i++) {
      tx_fifo[i].tx_buf = &alloc_tx_buf[i][0];
      tx_fifo[i].tx_buf_size = BUFFER_SZ;
      NRF_LOG_INFO("tx_fifo[%d].tx_buf_size %d\r\n", i, tx_fifo[i].tx_buf_size);
      err_code = app_fifo_init(&tx_fifo[i].tx_fifo_handle, tx_fifo[i].tx_buf, tx_fifo[i].tx_buf_size);
      APP_ERROR_CHECK(err_code);
      packet_data_cnt[i] = 0;
    }
    
    //for (i = 0; i < TX_ORDER_NUM; i++) {
    //  packet_data_tx_order[i] = 0xFF;
    //}
    
    app_fifo_init(&packet_data_tx_order_hd, packet_data_tx_order, TX_ORDER_NUM);
    
    // Start scanning for peripherals and initiate connection to devices which
    // advertise.
    scan_start();
    application_timers_start();

    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            // Wait for BLE events.
            power_manage();
        }
    }
}
